#---------Задача про копійки---------
# a=int(input("Кількість копійок: "))
# if 5<=a%10<=10 or a%10==0 or 5<=a<=20:
#        print (a ,"копійок")
# elif a%10==1:
#         print(a ,"копійка")
# elif 1< a%10<5:
#         print (a ,"копійки")



#---------Задача про гривні і копійки---------
a=int(input("Кількість гривень: "))
b=int(input("Кількість копійок: "))
if 5 <= a % 10 <= 10 or 5 <= a%100 <= 20:
   print (a, "гривень")
elif a % 10 == 1:
    print (a, "гривня")
elif 1 < a % 10 < 5:
    print (a, "гривні")
elif a==0:
    print()
if 5<=b%10<=10 or 5<=b<=20:
   print (b ,"копійок")
elif b%10==1:
    print(b ,"копійка")
elif 1< b%10<5:
    print (b ,"копійки")
elif b==0:
    print()
if a == 0 and b == 0:
    print ("У вас немає грошей")